site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** GCD
:PROPERTIES:
:EXPORT_FILE_NAME: GCD
:EXPORT_DATE: 2023-03-08
:ID:       f118cc9f-89b0-4a60-92e7-ed16708011fb
:END:

GCD, or Greatest Common Divisor, is a mathematical concept that refers to the largest positive integer that divides two or more numbers without leaving a remainder.

In class we will derive Euclid's algorithm, an efficient way of computing GCD, as well as explore some of the properties of GCD you will want to know when solving
competitve programming problems.

*** Materials

- [[/handouts/gcd.pdf][GCD Handout]]

